import pandas as pd
import re


# データフレームを引数として実行し、変換後のデータフレームを返す関数
def conversion_df(df):
    # 数字を漢数字へ変換するための変換テーブル
    table = str.maketrans({
        '1': '一',
        '2': '二',
        '3': '三',
        '4': '四',
        '5': '五',
        '6': '六',
        '7': '七',
        '8': '八',
        '9': '九',
        '０': '〇',
        '１': '一',
        '２': '二',
        '３': '三',
        '４': '四',
        '５': '五',
        '６': '六',
        '７': '七',
        '８': '八',
        '９': '九'
    })

    # 'アドレス'列を取得
    address_list = df['アドレス']

    # 二桁の数字の場合、数字の間に'十'を入れる
    str_list = [
        re.sub(r'([0-9０-９])([0-9０-９])', r'\1十\2', i) if re.compile('[0-9０-９][0-9０-９]').search(i) else i 
        for i in address_list
    ]

    # tableを使用して全ての数字を漢数字に変換し、'区'を削除
    df['アドレス'] = [s.translate(table).replace('区', '') for s in str_list]
    
    return df


# サンプルデータ作って返す関数
def create_sample_df():
    sample_data = [
        {
            "名称": "マンション名A",
            "カテゴリ": "マンション",
            "アドレス": "東京都世田谷区",
            "アクセス": "○○線/××駅 徒歩5分, △△線/□□駅 徒歩10分",
            "築年数": 10,
            "構造": 12,  # 最高階数
            "階数": 5,
            "家賃": 15.0,
            "管理費": 5000,
            "敷金": 2.0,
            "礼金": 1.0,
            "間取り": "2LDK",
            "面積": 65.08,
            "物件画像URL": "https://example.com/property_image.jpg",
            "間取画像URL": "https://example.com/floor_plan.jpg",
            "物件詳細URL": "https://example.com/property_details",
            "区": "世田谷区",
            "市町": "",
            "アクセス①1線路名": "○○線",
            "アクセス①1駅名": "××駅",
            "アクセス①1徒歩(分)": 5,
            "アクセス①2線路名": "△△線",
            "アクセス①2駅名": "□□駅",
            "アクセス①2徒歩(分)": 10,
            "アクセス①3線路名": None,
            "アクセス①3駅名": None,
            "アクセス①3徒歩(分)": None
        },
        {
            "名称": "アパートB",
            "カテゴリ": "アパート",
            "アドレス": "渋谷区桜丘町1-2",
            "アクセス": "□□線/◇◇駅 徒歩8分",
            "築年数": 25,
            "構造": 5,
            "階数": 3,
            "家賃": 10.0,
            "管理費": 3000,
            "敷金": 1.0,
            "礼金": 0.0,
            "間取り": "1K",
            "面積": 25.0,
            "物件画像URL": "https://example.com/property_image2.jpg",
            "間取画像URL": "https://example.com/floor_plan2.jpg",
            "物件詳細URL": "https://example.com/property_details2",
            "区": "渋谷区",
            "市町": "",
            "アクセス①1線路名": "□□線",
            "アクセス①1駅名": "◇◇駅",
            "アクセス①1徒歩(分)": 8,
            "アクセス②2線路名": None,
            "アクセス②2駅名": None,
            "アクセス②2徒歩(分)": None,
            "アクセス③3線路名": None,
            "アクセス③3駅名": None,
            "アクセス③3徒歩(分)": None
        },
        {
            "名称": "マンションC",
            "カテゴリ": "マンション",
            "アドレス": "世田谷区経堂1丁目28-12",
            "アクセス": "◆◆線/▲▲駅 徒歩3分, ■■線/●●駅 徒歩9分",
            "築年数": 5,
            "構造": 9,
            "階数": 7,
            "家賃": 18.0,
            "管理費": 8000,
            "敷金": 3.0,
            "礼金": 2.0,
            "間取り": "3LDK",
            "面積": 80.5,
            "物件画像URL": "https://example.com/property_image3.jpg",
            "間取画像URL": "https://example.com/floor_plan3.jpg",
            "物件詳細URL": "https://example.com/property_details3",
            "区": "世田谷区",
            "市町": "",
            "アクセス①1線路名": "◆◆線",
            "アクセス①1駅名": "▲▲駅",
            "アクセス①1徒歩(分)": 3,
            "アクセス①2線路名": "■■線",
            "アクセス①2駅名": "●●駅",
            "アクセス①2徒歩(分)": 9,
            "アクセス①3線路名": None,
            "アクセス①3駅名": None,
            "アクセス①3徒歩(分)": None
        },
        {
            "名称": "アパートD",
            "カテゴリ": "アパート",
            "アドレス": "渋谷区宇田川町23-5",
            "アクセス": "★★線/▼▼駅 徒歩12分",
            "築年数": 15,
            "構造": 4,
            "階数": 3,
            "家賃": 9.5,
            "管理費": 4000,
            "敷金": 1.5,
            "礼金": 0.5,
            "間取り": "1K",
            "面積": 20.0,
            "物件画像URL": "https://example.com/property_image4.jpg",
            "間取画像URL": "https://example.com/floor_plan4.jpg",
            "物件詳細URL": "https://example.com/property_details4",
            "区": "渋谷区",
            "市町": "",
            "アクセス①1線路名": "★★線",
            "アクセス①1駅名": "▼▼駅",
            "アクセス①1徒歩(分)": 12,
            "アクセス①2線路名": None,
            "アクセス①2駅名": None,
            "アクセス①2徒歩(分)": None,
            "アクセス①3線路名": None,
            "アクセス①3駅名": None,
            "アクセス①3徒歩(分)": None
        },
        {
            "名称": "マンションE",
            "カテゴリ": "マンション",
            "アドレス": "世田谷区等々力8-15-7",
            "アクセス": "◎◎線/☆☆駅 徒歩7分, ☆☆線/◇◇駅 徒歩10分, ◆◆線/△△駅 徒歩15分",
            "築年数": 2,
            "構造": 15,
            "階数": 10,
            "家賃": 25.0,
            "管理費": 10000,
            "敷金": 4.0,
            "礼金": 3.0,
            "間取り": "3LDK",
            "面積": 90.0,
            "物件画像URL": "https://example.com/property_image5.jpg",
            "間取画像URL": "https://example.com/floor_plan5.jpg",
            "物件詳細URL": "https://example.com/property_details5",
            "区": "世田谷区",
            "市町": "",
            "アクセス①1線路名": "◎◎線",
            "アクセス①1駅名": "☆☆駅",
            "アクセス①1徒歩(分)": 7,
            "アクセス①2線路名": "☆☆線",
            "アクセス①2駅名": "◇◇駅",
            "アクセス①2徒歩(分)": 10,
            "アクセス①3線路名": "◆◆線",
            "アクセス①3駅名": "△△駅",
            "アクセス①3徒歩(分)": 15
        }
    ]
    df = pd.DataFrame(sample_data)

    return df