import pandas as pd

# サンプルデータ作ってDataFrameにする関数
def create_sample_df():
    sample_data = [
        {
            "名称": "マンション名A",
            "カテゴリ": "マンション",
            "アドレス": "東京都世田谷区",
            "アクセス": "○○線/××駅 徒歩5分, △△線/□□駅 徒歩10分",
            "築年数": 10,
            "構造": 12,  # 最高階数
            "階数": 5,
            "家賃": 15.0,
            "管理費": 5000,
            "敷金": 2.0,
            "礼金": 1.0,
            "間取り": "2LDK",
            "面積": 65.08,
            "物件画像URL": "https://example.com/property_image.jpg",
            "間取画像URL": "https://example.com/floor_plan.jpg",
            "物件詳細URL": "https://example.com/property_details",
            "区": "世田谷区",
            "市町": "",
            "アクセス①1線路名": "○○線",
            "アクセス①1駅名": "××駅",
            "アクセス①1徒歩(分)": 5,
            "アクセス①2線路名": "△△線",
            "アクセス①2駅名": "□□駅",
            "アクセス①2徒歩(分)": 10,
            "アクセス①3線路名": None,
            "アクセス①3駅名": None,
            "アクセス①3徒歩(分)": None
        },
        {
            "名称": "アパートB",
            "カテゴリ": "アパート",
            "アドレス": "東京都渋谷区",
            "アクセス": "□□線/◇◇駅 徒歩8分",
            "築年数": 25,
            "構造": 5,
            "階数": 3,
            "家賃": 10.0,
            "管理費": 3000,
            "敷金": 1.0,
            "礼金": 0.0,
            "間取り": "1K",
            "面積": 25.0,
            "物件画像URL": "https://example.com/property_image2.jpg",
            "間取画像URL": "https://example.com/floor_plan2.jpg",
            "物件詳細URL": "https://example.com/property_details2",
            "区": "渋谷区",
            "市町": "",
            "アクセス①1線路名": "□□線",
            "アクセス①1駅名": "◇◇駅",
            "アクセス①1徒歩(分)": 8,
            "アクセス②2線路名": None,
            "アクセス②2駅名": None,
            "アクセス②2徒歩(分)": None,
            "アクセス③3線路名": None,
            "アクセス③3駅名": None,
            "アクセス③3徒歩(分)": None
        }
    ]
    df = pd.DataFrame(sample_data)
    return df